Authors:
    Ziyao Zhu
    Shan Wu

Description:
    This plugin can count how many commands were used and print those commands . It also can clear
    those records if necessary.

Commands:
    history
    history clear

Example:
    esh> cd ..
    esh> echo abc | rev
    cba
    esh> history
    There are total 2 commands in history
    cd ..
    echo abc | rev
    esh>history clear
    history is clear
    esh>history
    There are total 0 commands in history


